[
    {
        "user": "UE9QG16SC",
        "type": "message",
        "subtype": "channel_join",
        "ts": "1542965735.648300",
        "text": "<@UE9QG16SC> has joined the channel"
    },
    {
        "client_msg_id": "3922b3a3-2dd3-4675-b08b-d54fc5d2f451",
        "type": "message",
        "text": "<@U6QFVRJNB>greetings again!, just a follow-up on the issue I asked about before.\nI have performed \"lsblk in the sledgehammer env (also got ssh key and remote login to work as well, yay!)  and the harddrive is identified as \"sda\" with underlying sda1, sda2 partitions etc (can supply structure if you wish).\n\nI've played around in the bios setting\/unsetting uefi\/legacy, but haven't managed to get it to proper boot from the hard drive.\nAny other suggestions? :slightly_smiling_face:",
        "user": "UE7B053LG",
        "ts": "1542975944.651500"
    },
    {
        "client_msg_id": "a23b695e-3f1b-4994-b7d8-92421bf9b7f8",
        "type": "message",
        "text": "I also had another problem with actually performing pxe booting against the server I'm testing digital rebar with. Sometime it worked fine a few times, then had issues, and then totally stopped working. I changed a lot of configurations, trying to pinpoint the problem.\nIt turns out I had to enable a setting, and fill in some fields that would ensure compatibility with digital rebar in the unifi controller software.\nThought you guys could add the following below to your FAQ perhaps? :slightly_smiling_face:\nUnifi network equipment (using unifi security gateway) digital rebar support in the Unifi software controller:\nsettings --&gt; networks ---&gt; &lt;select your network&gt; --&gt; advanced dhcp options\ntick in \"enable dhcp network boot\"\n -- specify ip address to DRP endpoint\n -- specify bootfile to use (my case: \"lpxelinux.0\")\n\nI also had digital rebar subnet with dhcp proxy settings (and \"lpxelinux.0\") with this config.",
        "user": "UE7B053LG",
        "ts": "1542979835.655500",
        "edited": {
            "user": "UE7B053LG",
            "ts": "1542980469.000000"
        }
    },
    {
        "client_msg_id": "09fcb827-339c-41fe-9f01-67f59f64d2e8",
        "type": "message",
        "text": "<@UE7B053LG> if you have dhcp set correctly then you should not need to set the endpoint because of nextboot.  ",
        "user": "U02DHRR2L",
        "ts": "1542994564.658200"
    },
    {
        "client_msg_id": "9C432B7B-426A-40EF-94C9-F6152DA7B9AF",
        "type": "message",
        "text": "<@UE7B053LG> I’m not sure lpxleinux0 will work with uefi ",
        "user": "U02DGQYK1",
        "ts": "1542999868.658900"
    }
]